app/Controllers/Admin/AdminAuthController.php

SELECT `username`, `email`, `user_role`, `created_at`
FROM `users`
SELECT *
FROM `orders`
SELECT *
FROM `menu`
---
    public function dashboard()
    {
        $userModel = new UserModel();
        $orderModel = new OrderModel();
        $menuModel = new Menu();
        $transactionModel = new TransactionModel();

        $users = $userModel->select('username, email, user_role, created_at')->findAll();
        $orders = $orderModel->findAll(); // Fetch all orders
        $menus = $menuModel->findAll(); // Fetch all menu items

SELECT `username`, `email`, `user_role`, `created_at`
FROM `users`
---
    public function users()
    {
        $userModel = new UserModel();
        $users = $userModel->select('username, email, user_role, created_at')->findAll();

SELECT *
FROM `orders`
---
    public function orders()
    {
        $orderModel = new OrderModel();
        $orders = $orderModel->findAll();

SELECT *
FROM `menu`
---
    public function menu()
    {
        $menuModel = new Menu(); // Use the correct model name
        $menus = $menuModel->findAll(); // Fetch all menu items