app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin1@mail.com'
 LIMIT 1
---
    public function loginPost()
    {
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $user = $userModel->where('email', $email)->first();